# JoiningDisjoint Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..JoinElementsFailures..::..JoiningDisjoint Property
BuiltInFailures..::..JoinElementsFailures Class See Also
---
Highlighted elements are joined but do not intersect.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId JoiningDisjoint { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property JoiningDisjoint As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ JoiningDisjoint {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..JoinElementsFailures Class
Autodesk.Revit.DB Namespace